{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "batch_input_shape": [null, 3, 40, 40], "b_regularizer": null, "bias": true, "activation": "relu", "dim_ordering": "th", "W_regularizer": null, "nb_col": 5, "input_dtype": "float32", "b_constraint": null, "trainable": true, "subsample": [1, 1], "nb_row": 5, "nb_filter": 32}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "activation": "relu", "dim_ordering": "th", "W_regularizer": null, "nb_col": 5, "b_constraint": null, "trainable": true, "subsample": [1, 1], "nb_row": 5, "nb_filter": 32}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "activation": "relu", "dim_ordering": "th", "W_regularizer": null, "nb_col": 5, "b_constraint": null, "trainable": true, "subsample": [1, 1], "nb_row": 5, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "activation": "relu", "dim_ordering": "th", "W_regularizer": null, "nb_col": 5, "b_constraint": null, "trainable": true, "subsample": [1, 1], "nb_row": 5, "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "output_dim": 512, "name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "output_dim": 43, "name": "dense_2", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "softmax", "W_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null}}]}